{
  "name": "mt_on_transfer",
  "summary": "A reciever interface to take some action after receiving Multi tokens",
  "description": "A reciever interface to take some action after receiving Multi tokens. Contract MUST restrict calls to this funtion to a set of whitelisted MultiToken to prevent misuse.",
  "tags": [
    {
      "$ref": "../tags/change.json"
    }
  ],
  "params": [
    {
      "name": "sender_id",
      "summary": "sender of `mt_transfer_call`",
      "description": "sender of `mt_transfer_call`",
      "schema": {
        "$ref": "../schemas/AccountId.json"
      },
      "required": true
    },
    {
      "name": "previous_owner_id",
      "summary": "The account that owned the tokens prior to it being transferred",
      "description": "The account that owned the tokens prior to it being transferred",
      "schema": {
        "$ref": "../schemas/AccountId.json"
      },
      "required": true
    },
    {
      "name": "token_ids",
      "summary": "The `token_ids` argument given to `mt_transfer_call`",
      "description": "The `token_ids` argument given to `mt_transfer_call`",
      "schema": {
        "$ref": "../schemas/TokenIds.json"
      }
    },
    {
      "name": "amounts",
      "summary": "The amount of tokens per token id to transfer",
      "description": "The amount of tokens per token id to transfer. The ordering is a one to one matching with the token id. All amounts must be an amount that is 1 or more",
      "schema": {
        "$ref": "../schemas/Amounts.json"
      }
    },
    {
      "name": "msg",
      "summary": "The information necessary for this contract to know how to process the request.",
      "description": "The information necessary for this contract to know how to process the request. This may include method names or arguments or json",
      "schema": {
        "$ref": "../schemas/Msg.json"
      }
    }
  ],
  "result": {
    "name": "MtOnTransferResult",
    "summary": "Returns a vector of amounts for the tokens that were unused to be returned to `sender_id`",
    "description": "This function is implemented on the receving contract. As mentioned, the `msg` argument contains information necessary for the receiving contract to know how to process the request. This may include method names and/or arguments. Returns a value, or a promise which resolves with a value. The value is the number of unused tokens in string form. For instance, if `amount` is 10 but only 9 are needed, it will return 1.",
    "schema": {
      "type": "array",
      "items": [
        {
          "$ref": "../schemas/U128.json"
        }
      ]
    }
  }
}